settings.org
#+TITLE: Emacs Configuartion file

* Personal Information
This is me!
#+BEGIN_SRC emacs-lisp
(setq user-full-name "Berat Ertural"
      user-mail-address "berat.ertural@rwth-aachen.de")
#+END_SRC

* Customize settings
We will ignore the custom file for now. It's only trouble. Trouble, I say!

* Theme 
Tango-dark is comfy. 

#+BEGIN_SRC emacs-lisp

(load-theme 'tango-dark t)

#+END_SRC

** Font
We do like Monospaced fonts.

#+BEGIN_SRC emacs-lisp
(add-to-list 'default-frame-alist
             (cond
              ((string-equal system-type "darwin")    '(font . "Fira Code-13"))
              ((string-equal system-type "gnu/linux") '(font . "Fira Code-11"))))
#+END_SRC

* Defaults
Lets have some sane defaults, shall we?

#+BEGIN_SRC emacs-lisp
;; Theres a bug in Emacs (Bad Reques)
(setq gnutls-algorithm-priority "NORMAL:-VERS-TLS1.3")

;; Optimization
(setq gc-cons-threshold 100000000 ;  100mb
      read-process-output-max (* 1024 1024)) ; 1 mb

(defalias 'yes-or-no-p 'y-or-n-p)

;; Keep all backup and auto-save files in one directory
(setq backup-directory-alist '(("." . "~/.emacs.d/backups")))
(setq auto-save-file-name-transforms '((".*" "~/.emacs.d/auto-save-list/" t)))

;; UTF-8 encoding
(setq locale-coding-system 'utf-8)
(set-terminal-coding-system 'utf-8)
(set-keyboard-coding-system 'utf-8)
(set-selection-coding-system 'utf-8)
(prefer-coding-system 'utf-8)


(setq-default inhibit-startup-screen t
              indent-tabs-mode nil
              indicate-empty-lines t)

(tool-bar-mode -1)
(menu-bar-mode -1)
(show-paren-mode t)
(global-linum-mode t)
(column-number-mode t)
(delete-selection-mode t)

(setq shell-command-switch "-ic")
#+END_SRC

* Org-mode
I like to live in plain text.

#+BEGIN_SRC emacs-lisp
(use-package org)

  ;; Org-mode #+setupfile: tings
(add-to-list 'auto-mode-alist '("\\.org$" . org-mode))
(global-set-key "\C-c l" 'org-store-link)
(global-set-key "\C-c a" 'org-agenda)
(setq org-log-done t)

(require 'org-bullets)
(add-hook 'org-mode-hook (lambda () (org-bullets-mode 1)))
#+END_SRC

** Org/babel
*** Languages
List of supported languages. 
#+BEGIN_SRC emacs-lisp
(use-package ob-restclient
  :ensure t)

(org-babel-do-load-languages
 'org-babel-load-languages
 '((python . t)
   (C . t)
   (calc . t)
   (latex . t)
   (java . t)
   (ruby . t)
   (lisp . t)
   (scheme . t)
   (shell . t)
   (sqlite . t)
   (js . t)
   (restclient . t)
   (ledger . t)))

(defun my-org-confirm-babel-evaluate (lang body)
  "Do not confirm evaluation for these languages."
  (not (or (string= lang "C")
           (string= lang "java")
           (string= lang "python")
           (string= lang "emacs-lisp")
           (string= lang "sqlite"))))
(setq org-confirm-babel-evaluate 'my-org-confirm-babel-evaluate)

(setq ob-async-no-async-languages-alist '("ipython"))
#+END_SRC

*** Source code blocks
Lets have some pretty source block windows that don't mess with the indentation every time.
#+BEGIN_SRC emacs-lisp
  (setq org-src-fontify-natively t
	org-src-window-setup 'current-window
	org-src-strip-leading-and-trailing-blank-lines t
	org-src-preserve-indentation t
	org-src-tab-acts-natively t)
#+END_SRC

*** Templates
#+BEGIN_SRC emacs-lisp
(add-to-list 'org-structure-template-alist '("el" . "src emacs-lisp"))
(add-to-list 'org-structure-template-alist '("py" . "src python"))
(add-to-list 'org-structure-template-alist '("sh" . "src sh"))
(add-to-list 'org-structure-template-alist '("md" . "src markdown"))
(add-to-list 'org-structure-template-alist '("gq" . "src graphql"))
#+END_SRC
** Org export
#+BEGIN_SRC emacs-lisp
(use-package ox-pandoc
  :no-require t
  :defer 10
  :ensure t)
#+END_SRC
* Which-key
Handy if you forget the specific keybindings. You only need to remember the mode-map key.

#+BEGIN_SRC emacs-lisp
(use-package which-key
  :config
  (which-key-mode))
#+END_SRC

* Projectile

#+BEGIN_SRC emacs-lisp

(use-package projectile
  :ensure t
  :diminish projectile-mode
  :commands (projectile-mode projectile-switch-project)
  :bind (("C-c p p" . projectile-switch-project)
         ("C-c p s s" . projectile-ag)
         ("C-c p s r" . projectile-ripgrep))
  :config
  (setq projectile-keymap-prefix (kbd "C-c p"))
  (projectile-global-mode t)
  (setq projectile-enable-caching t))

#+END_SRC

* Helm

#+BEGIN_SRC emacs-lisp

  (use-package helm
    :disabled t
    :ensure t
    :diminish helm-mode
    :bind (("C-c h" . helm-command-prefix)
	   ("C-x b" . helm-mini)
	   ("C-`" . helm-resume)
	   ("M-x" . helm-M-x)
	   ("C-x C-f" . helm-find-files)
	   ("C-x C-r" . helm-recentf))
    :init
    (require 'helm-config)
    :config
    (setq helm-locate-command "mdfind -interpret -name %s %s"
	  helm-ff-newfile-prompt-p nil
	  helm-M-x-fuzzy-match t)
    (helm-mode)
    (set-face-attribute 'helm-source-header nil :height 0.1)
    (helm-autoresize-mode 1)
    (setq helm-display-header-line nil)
    (setq helm-autoresize-max-height 30)
    (setq helm-autoresize-min-height 30))

  (use-package helm-projectile
    :ensure t
    :after helm-mode
    :commands helm-projectile
    :bind ("C-c p h" . helm-projectile))

#+END_SRC

* Flycheck 
#+BEGIN_SRC emacs-lisp
(use-package flycheck
  :ensure t
  :diminish flycheck-mode
  :defer 10
  :config 
  (setq flycheck-html-tidy-executable "tidy5")
  (global-flycheck-mode))
#+END_SRC

* Yasnippet

#+BEGIN_SRC emacs-lisp
(use-package yasnippet
  :ensure t
  :diminish yas-minor-mode
  :config
  (add-to-list 'yas-snippet-dirs (locate-user-emacs-file "snippets"))
  (setq yas-indent-line 'fixed)
  (yas-global-mode))
#+END_SRC

* Company
#+BEGIN_SRC emacs-lisp
(use-package company
  :ensure t
  :diminish company-mode
  :config
  (setq company-tooltip-limit 20)
  (setq company-idle-delay .15)
  (setq company-echo-delay 0)
  (setq company-begin-commands '(self-insert-command))
  (define-key company-active-map (kbd "C-n") #'company-select-next)
  (define-key company-active-map (kbd "C-p") #'company-select-previous)
  (add-hook 'after-init-hook 'global-company-mode))
#+END_SRC

* Undo-tree
#+BEGIN_SRC emacs-lisp
(use-package undo-tree
  :diminish undo-tree-mode
  :bind (("M-/" . undo-tree-visualize)))
#+END_SRC
* SR-Speedbar

#+BEGIN_SRC emacs-lisp
(use-package sr-speedbar
  :ensure t
  :config
  (setq speedbar-show-unknown-files t))
#+END_SRC

* Smartparens
#+BEGIN_SRC emacs-lisp
(require 'smartparens-config)
(setq smartparens-global-mode t)
#+END_SRC

* Language Server Protocoll
** Language Servers
*** C/C++
#+BEGIN_SRC emacs-lisp
(use-package ccls
  :init
  (setq ccls-executable "/home/berat/aur/ccls/Release/ccls")
  :config
  (setq lsp-prefer-flymake nil)
  (setq-default flycheck-disabled-checkers '(c/c++-clang c/c++-cppcheck c/c++-gcc)))
#+END_SRC

** LSP
#+BEGIN_SRC emacs-lisp

  (use-package lsp-mode
    :ensure ccls
    :hook prog-mode
    :bind (("C-c l" . lsp-keymap-prefix))
    :config
    (setq lsp-clients-clangd-args '("-j=4" "-background-index" "-log=error"))
    (setq lsp-enable-indentation nil)
    (add-hook 'lsp-mode-hook #'lsp-enable-which-key-integration))

  ;; Company-LSP
  (require 'company-lsp)
  (push 'company-lsp company-backends)

#+END_SRC

* LaTeX

#+BEGIN_SRC emacs-lisp
(use-package tex
  :ensure auctex
  :config
  (setq-default TeX-master nil))
#+END_SRC

* Gnu Debug

#+BEGIN_SRC emacs-lisp

(setq gdb-many-windows t)

#+END_SRC

* CMake

#+BEGIN_SRC 

(use-package cmake-mode)

#+END_SRC

* Web Mode

#+BEGIN_SRC emacs-lisp
(use-package web-mode
  :config
  (add-to-list 'auto-mode-alist '("\\.phtml\\'" . web-mode))
  (add-to-list 'auto-mode-alist '("\\.tpl\\.php\\'" . web-mode))
  (add-to-list 'auto-mode-alist '("\\.html\\.twig\\'" . web-mode))
  (add-to-list 'auto-mode-alist '("\\.html?\\'" . web-mode)))
#+END_SRC

* Slime

#+BEGIN_SRC emacs-lisp
(use-package slime
  :hook lisp-mode
  :init
  (setq inferior-lisp-program "/usr/bin/sbcl")
  (load "~/quicklisp/clhs-use-local.el" t)
  (load (expand-file-name "~/quicklisp/slime-helper.el")))
#+END_SRC
* Assembler

RGBDS is the Assembler Toolchain used for Gameboy DMG Z80 development.

#+BEGIN_SRC emacs-lisp
(require 'rgbds-mode)
(add-to-list 'auto-mode-alist '("\\.inc\\'" . asm-mode))
#+END_SRC

* Non-MELPA
** Language Support
*** Lua
#+BEGIN_SRC emacs-lisp
(autoload 'lua-mode "lua-mode" "Lua editing mode." t)
(add-to-list 'auto-mode-alist '("\\.lua$" . lua-mode))
(add-to-list 'interpreter-mode-alist '("lua" . lua-mode))
(setq lua-indent-level 2)
#+END_SRC

*** GLSL
 #+BEGIN_SRC emacs-lisp
(autoload 'glsl-mode "glsl-mode" "GLSL Editing mode." t)
(add-to-list 'auto-mode-alist '("\\.glsl\\'" . glsl-mode))
(add-to-list 'auto-mode-alist '("\\.vert\\'" . glsl-mode))
(add-to-list 'auto-mode-alist '("\\.frag\\'" . glsl-mode))
(add-to-list 'auto-mode-alist '("\\.geom\\'" . glsl-mode))
 #+END_SRC

* Keybindings

#+BEGIN_SRC emacs-lisp
(defun toggle-text-fold (&optional level)
  "Fold text indented by LEVEL."
  (interactive "P")
  (if (eq selective-display (1+ (current-column)))
      (set-selective-display 0)
    (set-selective-display (or level (1+ (current-column))))))

(global-set-key (kbd "<f2>") #'sr-speedbar-toggle)
(global-set-key (kbd "<f3>") #'toggle-text-fold)
#+END_SRC

* Languages
** C-Mode

#+BEGIN_SRC emacs-lisp
(defun my-c-mode-hook ()
  "C-Style specific properties."
  ;; Default behaviour
  (setq c-basic-offset 4)
  (c-set-offset 'substatement-open 0)  
  (c-set-offset 'case-label 4)

  ;; Company C Headers
  (setq company-c-headers-path-system
        '("/usr/include/c++/9.2.0" 
          "/usr/avr/include"
          "/usr/include"
          "/usr/local/include"))
  (add-to-list 'company-backends 'company-c-headers))

(add-hook 'c-mode-common-hook 'my-c-mode-hook)
#+END_SRC

** Elpy

#+BEGIN_SRC emacs-lisp
(use-package elpy
  :ensure t
  :init
  (elpy-enable)
  :config
  (setq python-shell-interpreter "python3"
        python-shell-interpreter-args "-i"
        elpy-rpc-python-command "python3"))
#+END_SRC
